export type 시도명 = (typeof OFFICE_CODE_TO_NAMES)[시도교육청코드][0];
export type 시도교육청명 = (typeof OFFICE_CODE_TO_NAMES)[시도교육청코드][1];

export const OFFICE_CODE_TO_NAMES = {
	B10: ['서울특별시', '서울특별시교육청'],
	C10: ['부산광역시', '부산광역시교육청'],
	D10: ['대구광역시', '대구광역시교육청'],
	E10: ['인천광역시', '인천광역시교육청'],
	F10: ['전남광주통합특별시(광주)', '전남광주통합특별시교육청(광주)'],
	G10: ['대전광역시', '대전광역시교육청'],
	H10: ['울산광역시', '울산광역시교육청'],
	I10: ['세종특별자치시', '세종특별자치시교육청'],
	J10: ['경기도', '경기도교육청'],
	K10: ['강원특별자치도', '강원특별자치도교육청'],
	M10: ['충청북도', '충청북도교육청'],
	N10: ['충청남도', '충청남도교육청'],
	P10: ['전북특별자치도', '전북특별자치도교육청'],
	Q10: ['전남광주통합특별시(전남)', '전남광주통합특별시교육청(전남)'],
	R10: ['경상북도', '경상북도교육청'],
	S10: ['경상남도', '경상남도교육청'],
	T10: ['제주특별자치도', '제주특별자치도교육청'],
	V10: ['재외한국학교', '재외한국학교교육청'],
} as const satisfies Record<시도교육청코드, readonly [string, string]>;

export type 시도교육청코드 = (typeof OFFICE_CODES)[number];
export const OFFICE_CODES = [
	'B10',
	'C10',
	'D10',
	'E10',
	'F10',
	'G10',
	'H10',
	'I10',
	'J10',
	'K10',
	'M10',
	'N10',
	'P10',
	'Q10',
	'R10',
	'S10',
	'T10',
	'V10',
] as const;
